In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__, np.__version__

('1.1.2', '1.18.1')

In [3]:
# needs 2 steps, 1 to assign the dataframe to a variable

df = pd.DataFrame({
    'name':['john', 'david', 'anna'],
    'country':['USA', 'UK', np.nan]
})
df

    name country
0   john     USA
1  david      UK
2   anna     NaN

In [4]:
# 2 to perform the filter
df[df['country']=='USA']

   name country
0  john     USA

In [8]:
df = pd.DataFrame({
    'name':['john', 'david', 'anna'],
    'country':['USA', 'UK', np.nan]
}).query("country =='USA'")
df

   name country
0  john     USA

# query where is null

In [9]:
df = pd.DataFrame({
    'name':['john', 'david', 'anna'],
    'country':['USA', 'UK', np.nan]
})
df.query('country.isnull()')

   name country
2  anna     NaN

# query with python variable

In [10]:
df = pd.DataFrame({
    'name':['john', 'david', 'anna'],
    'country':['USA', 'UK', np.nan],
    'age':[23, 45,45]
})

target_age = 45

df.query('age == @target_age')

    name country  age
1  david      UK   45
2   anna     NaN   45

# OR operator

In [12]:
df = pd.DataFrame({
    'name':['john', 'david', 'anna'],
    'country':['USA', 'UK', np.nan],
    'age':[23, 45,45]
})
df

    name country  age
0   john     USA   23
1  david      UK   45
2   anna     NaN   45

In [14]:
df.query("(name=='john') or (country=='UK')")

    name country  age
0   john     USA   23
1  david      UK   45

# AND operator

In [15]:
df = pd.DataFrame({
    'name':['john', 'david', 'anna'],
    'country':['USA', 'UK', np.nan],
    'age':[23, 45,45]
})

df.query("(country=='USA') or (age==23)")

   name country  age
0  john     USA   23

# Column is in array

In [16]:
df = pd.DataFrame({
    'name':['john', 'david', 'anna'],
    'country':['USA', 'UK', np.nan],
    'age':[23, 45,45]
})

In [17]:
names_array = ['john', 'anna']

df.query('name in @names_array')

   name country  age
0  john     USA   23
2  anna     NaN   45

In [18]:
invalid_array = ['anna']

df.query('name not in @invalid_array')

    name country  age
0   john     USA   23
1  david      UK   45

# column name with space

In [20]:
df = pd.DataFrame({
    'name':['john', 'david', 'anna'],
    'country of birth':['USA', 'UK', 'USA'],
    'age':[23, 45,45]
})

df.query("`country of birth` =='UK'")

    name country of birth  age
1  david               UK   45

In [25]:
df = pd.DataFrame({
    'name':['john', 'david', 'anna'],
    'country':['USA', 'UK', np.nan],
    'age':[23, 45,45]
 })

In [26]:
df.query('country.isnull()')

   name country  age
2  anna     NaN   45

# Where column is not null

In [27]:
df.query('country.notnull()')

    name country  age
0   john     USA   23
1  david      UK   45

# like

In [28]:
df = pd.DataFrame({
    'col1':['foo', 'bar', 'baz', 'quux']
})
print(df)
df.query('col1.str.contains("ba")')

   col1
0   foo
1   bar
2   baz
3  quux

  col1
1  bar
2  baz